[
  {
    "id": 1,
    "title": "Flying",
    "date": "01/01/2023",
    "entry": "Flying over the sun.",
    "analysis": "Dreaming about flying over the sun can relate to personal freedom, joy, and aspirations. The sun often signifies a source of enlightenment, energy, and life. If you are flying over it, the dream can mean you are blossoming in some area of your life or achieving balance. However, it could also indicate that you have unrealistic or overly ambitious goals. As a caution, aiming too high could lead to a downfall. It is essential to keep your plans and aspirations in check with reality. Please remember that all dream interpretations may vary based on your personal, emotional, and life experiences.",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-1jthN45h00aFw8PRjoJoJTiI.png?st=2023-07-03T01%3A40%3A16Z&se=2023-07-03T03%3A40%3A16Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A27%3A00Z&ske=2023-07-03T20%3A27%3A00Z&sks=b&skv=2021-08-06&sig=mOjQu2JKFAx%2BfJHrZPhag390BqQoclQI%2BiUgHuHc9%2BM%3D"
    }
  },
  {
    "id": 2,
    "title": "Pyramids",
    "date": "01/02/2023",
    "entry": "Traveling through endless pyramid tunnels solving puzzles and fighting monsters.",
    "analysis": "This dream combines elements of adventure, problem-solving, and facing fears. If we break down your dream, each element can hold a symbolic meaning:\n\n1. Pyramids or any large structures often symbolically represent your mind, spirituality, or self-discovery journey. Thus, traveling through pyramid tunnels could signify that you are navigating your inner self or seeking enlightenment. \n\n2. Solving puzzles symbolizes problem solving in your waking life. You might be dealing with some complex issues right now and the dream might be signaling that you need to tackle them one step at time, or that you are successfully maneuvering through these challenges.\n\n3. Fighting monsters is a common dream theme that typically represents facing personal fears and overcoming obstacles. The monsters can symbolize hostile environments",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-kQ1dQLF7hSaPdtckVRYBureu.png?st=2023-07-03T02%3A47%3A05Z&se=2023-07-03T04%3A47%3A05Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A28%3A11Z&ske=2023-07-03T20%3A28%3A11Z&sks=b&skv=2021-08-06&sig=ZxNkZ23Cmmx1VqFpZL9jR/9h1NH/hn2exQwfMATGrfc%3D"
    }
  },
  {
    "id": 3,
    "title": "Falling",
    "date": "01/03/2023",
    "entry": "Falling off a building only to be saved by a friend.",
    "analysis": "This dream can be interpreted in many ways, but mainly it seems to signify fear and insecurity. Falling from a building might represent a sense of losing control or feeling overwhelmed in some area of your life. Being saved by a friend, however, suggests that you have support in your waking life. You may be undergoing some difficult times, but you are not alone. The friend who saves you might be someone you can depend on in real life to help you through this trying period. This dream reminds you of the importance of asking for help and leaning on the supportive people in your life when you need them.",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-xvo6MnC5ZqACFxR42GpnrZdl.png?st=2023-07-03T03%3A42%3A54Z&se=2023-07-03T05%3A42%3A54Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A36%3A44Z&ske=2023-07-03T20%3A36%3A44Z&sks=b&skv=2021-08-06&sig=2WFFB4itXdi%2BfKKVBISWwIfBj3rRxAgRjgqKsaExzks%3D"
    }
  },
  {
    "id": 4,
    "title": "Funeral",
    "date": "01/04/2023",
    "entry": "I was at my own funeral.",
    "analysis": "Dreaming about your own funeral doesn't necessarily predict illness or death. Instead, it usually symbolizes an ending to one aspect of your life and the beginning of another. It can represent self-change or personal development. Maybe you are moving from one phase of your life to another, or you're undergoing a transformation. This could also mean that you wish to terminate your old habits or past actions. If the atmosphere in your dream was serene or peaceful, it suggests you are fully embracing these transformations. If the mood was somber, it might indicate unresolved grief or deeply buried issues that need addressing. Remember, dreams are subjective and your personal feelings, experiences, and circumstances play a major role in its interpretation.",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-mzMalQprvtRYqElEdTHeKrex.png?st=2023-07-03T03%3A46%3A13Z&se=2023-07-03T05%3A46%3A13Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A27%3A45Z&ske=2023-07-03T20%3A27%3A45Z&sks=b&skv=2021-08-06&sig=HDWEggfGRW20cG4Ikmo9hDsSp5nRD1HMiv/ai8n5f2Q%3D"
    }
  },
  {
    "id": 5,
    "title": "Ocean",
    "date": "01/05/2023",
    "entry": "I was swimming in the open ocean in the dark for endless miles.",
    "analysis": "This dream might suggest feelings of emotional depth, isolation or uncertainty in your waking life. Swimming in the dark ocean signifies delving into the unconscious or facing profound emotions that perhaps you hesitate to deal with during your waking hours. It could also signify limited visibility or lack of clarity about your current situation. The fact that it stretches for \"endless miles\" further reinforces feelings of entrapment or being overwhelmed by a situation or emotion. As each dream is influenced by personal experiences, understanding the context in relation with real life situations can offer closer interpretations.",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-50nUDy19ULudsjM1lQOaWCZc.png?st=2023-07-03T04%3A27%3A14Z&se=2023-07-03T06%3A27%3A14Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A35%3A44Z&ske=2023-07-03T20%3A35%3A44Z&sks=b&skv=2021-08-06&sig=9ls5LVamcH3VM0XRFBGKSOQOJGu2hUibJdk%2BRkq8ylM%3D"
    }
  },
  {
    "id": 6,
    "title": "Jungle",
    "date": "01/06/2023",
    "entry": "I was part of a family who lived in the jungle thousands of years ago.",
    "analysis": "This dream may represent your deep desire to go back to the basics, to be more connected with nature and a simpler way of life. Probably, you may be feeling overwhelmed with the complexities and demands of modern life and this dream is a manifestation of that discontent and longing. Additionally, this could also reflect your strong familial tendencies, indicating your desire for close-knit, supportive relationships. It could also be about survival, resourcefulness, and adaptability in times of uncertainty or challenging situations.",
    "image": {
      "url": "https://oaidalleapiprodscus.blob.core.windows.net/private/org-srvub5vj5MJVFgVAF3jsHTrL/user-3aUWDSCHybW88nMwAN93yNqg/img-BZ0sZdXD3UsDx98mK7ya3X8N.png?st=2023-07-03T04%3A41%3A22Z&se=2023-07-03T06%3A41%3A22Z&sp=r&sv=2021-08-06&sr=b&rscd=inline&rsct=image/png&skoid=6aaadede-4fb3-4698-a8f6-684d7786b067&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2023-07-02T20%3A33%3A51Z&ske=2023-07-03T20%3A33%3A51Z&sks=b&skv=2021-08-06&sig=20oe4vgfD1Cd7FISDu1MqvHuJxd%2BgUttqICI01hnyZk%3D"
    }
  }
]